---
title: Scratch
tags: scratch
published: 2018-02-19
---
# Local Variables:
# before-save-hook: org-babel-execute-buffer
# End:
#+SETUPFILE: ../../default-options.org

#+BEGIN_SRC ein
var mkGraphHtml = require('./content/data/offline/plot-helper')
#+END_SRC

#+RESULTS[e975fdbb29474a015d0436cc1fc5319efb334b1c]:

#+BEGIN_SRC ein
var nerdamer = require('nerdamer/all')
nerdamer('x * 2 + 1')
#+END_SRC

#+RESULTS[cf6aab2f4814c43bdb36e21ba68064cdb74cceb1]:
#+begin_example
{ [String: '1+2*x']
  symbol: 
   { [String: '1+2*x']
     group: 8,
     value: '1+2*x',
     multiplier: { [Number: 1] num: [Object], den: [Object] },
     imaginary: false,
     isInfinity: false,
     power: { [Number: 1] num: [Object], den: [Object] },
     symbols: { x: [Object], '#': [Object] },
     length: 2 } }
#+end_example

#+BEGIN_SRC ein
function ident(x) {
  switch (x) {
    case "fo":
      return console.log(x)
  }
}
#+END_SRC

#+RESULTS[8ccea49718fd03dcc65ab9fc525821fa67dc1b22]:

#+BEGIN_SRC ein
1
#+END_SRC

#+RESULTS[19d5749832f6b51d3e4e59da448739cd619d3426]:
: 1

#+BEGIN_SRC ein :file demo.html
var chart = {
  "description": "A simple bar chart with embedded data.",
  "data": {
    "values": [
      {"a": "A","b": 28}, {"a": "B","b": 55}, {"a": "C","b": 43},
      {"a": "D","b": 91}, {"a": "E","b": 81}, {"a": "F","b": 53},
      {"a": "G","b": 19}, {"a": "H","b": 87}, {"a": "I","b": 42}
    ]
  },
  "mark": "bar",
  "encoding": {
    "x": {"field": "a", "type": "ordinal"},
    "y": {"field": "b", "type": "quantitative"}
  }
}
$$html$$ = mkGraphHtml(chart)
#+END_SRC

#+RESULTS[99de04df9d6277cafb185fa1b69901d8bd041b45]:
[[file:demo.html]]
